# DataFrame에서 연산 다양한 연산을 수행하는 방법
- add, sub, div, mul
-

In [1]:
import pandas as pd
import numpy as np

In [6]:
a = pd.Series(range(1,6), index = list("abcde"))
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [29]:
b = pd.Series(range(4,10), index = list("bdfert"))
b

b    4
d    5
f    6
e    7
r    8
t    9
dtype: int64

In [9]:
a.add(b)

a     NaN
b     6.0
c     NaN
d     9.0
e    12.0
f     NaN
r     NaN
t     NaN
dtype: float64

In [10]:
a+b

a     NaN
b     6.0
c     NaN
d     9.0
e    12.0
f     NaN
r     NaN
t     NaN
dtype: float64

DataFrame을 이용하여 연산하기

In [16]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list("ABC")) #3행3열의 데이터를 만들게 된다.
df1

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [19]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4),columns=list("ABCD")) #4행4열의 데이터를 만들게 된다. columns=list("ABCD")는 한글자씩 칼럼명이 된다.
df2

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
df1 + df2 #데이터가 일치 않는 경우ㅠ는 NaN이 된다.

      A     B     C   D
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

## Series + DataFrame

In [22]:
df = pd.DataFrame(np.arange(16).reshape(4,4),columns=list("ABCD")) #4행4열의 데이터를 만들게 된다.
df #df : 데이터프레임 줄임말

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
s = pd.Series(np.arange(10, 14), index=list("ABCD"))
s

A    10
B    11
C    12
D    13
dtype: int64

In [27]:
df +s # n번째 행들의 값에 10~13까지 각각 더하였다.
#DataFrame과 Series를 연산하면 컬럼을 기준으로 브로드 캐스팅

    A   B   C   D
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [31]:
# DF에는 컬럼명이 있다. 드런데 시리즈에는 컬럼명이 없다면?
s = pd.Series(np.arange(10, 14))
s

0    10
1    11
2    12
3    13
dtype: int64

In [34]:
df +s # DF에는 컬럼명이 있다. 드런데 시리즈에는 컬럼명이 없다=>일치하는 컬럼명없음->브로드캐스팅 연산이 불가함->NaN으로 처리됨.

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [35]:
# 더할 데이터가 많으면 add연산자로 하는게 +로 일일이 하는 것보다 편하다.
#또한 add연산자는 축을 기준으로 연산하라고 설정이 가능하기에 컬럼명이 일치않아도 브로드캐스팅이 가능하게 한다.
#일치하는 컬럼명을 일일 이 설정하기 힘든 경우에 쓰기 좋다.
df.add(s,axis=0) # axis를 기준으로 브로드캐스팅이 일어남

    A   B   C   D
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28